chriskinal/QuailTracker/esp32_bridge/src/main.c
/*
 * ESP32-C3 Bridge — BLE Beacon + SPI Slave + WiFi-on-Demand + WebSocket
 *
 * Power states:
 *   LOW_POWER:    BLE advertising only, WiFi off, SPI slave idle (~1-3mA)
 *   NORMAL_POWER: BLE + WiFi AP + SPI active, full web UI (~80mA)
 *
 * State transitions:
 *   Boot → LOW_POWER (BLE beacon starts)
 *   BLE connect OR SPI activity → NORMAL_POWER (WiFi starts, STM32 woken if sleeping)
 *   BLE disconnect + 30s timeout → LOW_POWER (WiFi stops)
 *   STM32 sends sleep command → LOW_POWER
 *
 * Wiring (ESP32-C3 Super Mini):
 *   GPIO4  = SCK
 *   GPIO6  = MOSI (master out, slave in)
 *   GPIO5  = MISO (master in, slave out)
 *   GPIO7  = CS (also used as wake output when STM32 is sleeping)
 */

#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/spi_slave.h"
#include "driver/gpio.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_http_server.h"
#include "nvs_flash.h"
#include "esp_netif.h"
#include "esp_mac.h"
#include "esp_sleep.h"
#include "esp_ota_ops.h"
#include "lwip/sockets.h"
#include "lwip/netdb.h"
#include "ble_beacon.h"
#include "stm32_flash.h"
#include "spi_protocol.h"

#define TAG "BRIDGE"
#define ESP_FW_VERSION "0.2.0"

/* ── Power State ───────────────────────────────────────────────── */

typedef enum {
    BRIDGE_LOW_POWER,     /* BLE only, WiFi off */
    BRIDGE_NORMAL_POWER,  /* BLE + WiFi + SPI */
} bridge_power_t;

static volatile bridge_power_t bridge_state = BRIDGE_NORMAL_POWER;
static volatile uint32_t disconnect_tick = 0;   /* tick when BLE disconnected */
static volatile bool stm32_sleeping = false;     /* true = STM32 in Stop 2 */
static bool wifi_started = false;

/* WiFi duty cycle for low-power mode: on 30s, deep sleep 60s.
 * During deep sleep the ESP32 draws ~5µA instead of 44mA.
 * 30s on-time allows for ESP32 boot (~3s) + phone WiFi scan + connect.
 * Disabled by default — WiFi stays on continuously. */
static bool wifi_duty_cycle = false;
#define WIFI_DUTY_ON_MS   30000
#define WIFI_DUTY_SLEEP_S 60
bool spi_initialized = false;
static TaskHandle_t spi_task_handle = NULL;
static volatile bool spi_task_stop = false;

#define BLE_DISCONNECT_TIMEOUT_MS 30000  /* 30s before stopping WiFi */

/* ── SPI Slave Config ──────────────────────────────────────────── */

#define SPI_HOST       SPI2_HOST
#define PIN_MOSI       6
#define PIN_MISO       5
#define PIN_SCK        4
#define PIN_CS         7
#define TRANSFER_SIZE  1024

WORD_ALIGNED_ATTR uint8_t spi_rxBuf[TRANSFER_SIZE];
WORD_ALIGNED_ATTR uint8_t spi_txBuf[TRANSFER_SIZE];

/* Last received SPI data — binary state + config cache */
static uint32_t spi_transaction_count = 0;
static bool new_spi_data = false;

/* Local binary caches (populated from SPI RX frames) */
static device_config_t local_cfg;
static spi_state_t     local_state;
static uint32_t        local_cfg_seq = 0;
static bool            stm32_synced = false;
static bool            first_boot = true;

/* Command queue: browser → SPI (ring buffer, 8 deep) */
#define CMD_QUEUE_SIZE 8
static qt_spi_cmd_t cmd_queue[CMD_QUEUE_SIZE];
static volatile uint8_t cmd_head = 0, cmd_tail = 0;
static portMUX_TYPE cmd_mux = portMUX_INITIALIZER_UNLOCKED;
static uint32_t cmd_seq_counter = 0;

static void cmd_enqueue(uint8_t cmd_type, const uint8_t *payload, uint8_t payload_len)
{
    portENTER_CRITICAL(&cmd_mux);
    uint8_t next = (cmd_head + 1) % CMD_QUEUE_SIZE;
    if (next != cmd_tail) {  /* not full */
        memset(&cmd_queue[cmd_head], 0, sizeof(qt_spi_cmd_t));
        cmd_queue[cmd_head].cmd = cmd_type;
        cmd_queue[cmd_head].seq = ++cmd_seq_counter;
        if (payload && payload_len > 0) {
            if (payload_len > 56) payload_len = 56;
            memcpy(cmd_queue[cmd_head].payload, payload, payload_len);
        }
        cmd_head = next;
    }
    portEXIT_CRITICAL(&cmd_mux);
}

static bool cmd_dequeue(qt_spi_cmd_t *out)
{
    portENTER_CRITICAL(&cmd_mux);
    if (cmd_tail == cmd_head) {
        portEXIT_CRITICAL(&cmd_mux);
        return false;
    }
    memcpy(out, &cmd_queue[cmd_tail], sizeof(qt_spi_cmd_t));
    cmd_tail = (cmd_tail + 1) % CMD_QUEUE_SIZE;
    portEXIT_CRITICAL(&cmd_mux);
    return true;
}

/* Legacy JSON helpers — kept for parsing config from browser */

/* ── WiFi AP Config ────────────────────────────────────────────── */

#define WIFI_CHANNEL   6
#define MAX_CONNECTIONS 4

/* Device name — used for both WiFi SSID and BLE name.
 * Default: "QT_XXXX" where XXXX = last 4 hex digits of MAC.
 * Updated to station ID when learned from STM32 via SPI. */
static char device_name[32] = "";

static esp_netif_t *wifi_ap_netif = NULL;

/* ── WebSocket Client Tracking ─────────────────────────────────── */

#define MAX_WS_CLIENTS 4
static int ws_fds[MAX_WS_CLIENTS] = {0};
static httpd_handle_t ws_server = NULL;

static void ws_add_client(int fd)
{
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] == 0) {
            ws_fds[i] = fd;
            ESP_LOGI(TAG, "WS client added: fd=%d", fd);
            return;
        }
    }
}

static void ws_remove_client(int fd)
{
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] == fd) {
            ws_fds[i] = 0;
            ESP_LOGI(TAG, "WS client removed: fd=%d", fd);
            return;
        }
    }
}

static void ws_broadcast(const char *json)
{
    if (!ws_server) return;

    httpd_ws_frame_t ws_pkt = {
        .type = HTTPD_WS_TYPE_TEXT,
        .payload = (uint8_t *)json,
        .len = strlen(json),
    };

    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] != 0) {
            esp_err_t ret = httpd_ws_send_frame_async(ws_server, ws_fds[i], &ws_pkt);
            if (ret != ESP_OK) {
                ws_remove_client(ws_fds[i]);
            }
        }
    }
}

/* ── Web Page (generated from src/web/index.html via xxd) ──────── */

#include "web_data.h"

/* ── HTTP + WebSocket Handlers ─────────────────────────────────── */

/* Called when any HTTP/WS socket closes — clean up stale WS clients */
static void on_sock_close(httpd_handle_t hd, int sockfd)
{
    ws_remove_client(sockfd);
    close(sockfd);
}

static esp_err_t root_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "text/html");
    httpd_resp_send(req, (const char *)src_web_index_html, src_web_index_html_len);
    return ESP_OK;
}

static int json_get_int(const char *json, const char *key, int def);
void save_duty_cycle(void);

/* State API: returns current config + state as JSON for initial page load */
static esp_err_t api_state_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "application/json");
    /* Build a compact JSON with key fields for initial UI population */
    char buf[256];
    snprintf(buf, sizeof(buf),
        "{\"synced\":%d,\"station\":\"%s\",\"gain\":%d,\"fmt\":%d,"
        "\"bat\":%u,\"rec\":%d,\"pwrState\":%d}",
        (int)stm32_synced, local_cfg.stationId,
        (int)local_cfg.gain, (int)local_cfg.recFormat,
        (unsigned)local_state.env_battMv,
        (int)local_state.rec_active,
        (int)local_state.pwr_state);
    httpd_resp_sendstr(req, buf);
    return ESP_OK;
}

/* ESP32 config: GET returns JSON, POST sets values */
static esp_err_t esp_config_get_handler(httpd_req_t *req)
{
    char buf[64];
    snprintf(buf, sizeof(buf), "{\"dutyCycle\":%d}", wifi_duty_cycle ? 1 : 0);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, buf);
    return ESP_OK;
}

