chriskinal/QuailTracker/esp32_bridge/src/main.c
static esp_err_t esp_config_post_handler(httpd_req_t *req)
{
    char buf[128];
    int len = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (len <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "No data");
        return ESP_FAIL;
    }
    buf[len] = '\0';

    int val = json_get_int(buf, "dutyCycle", -1);
    if (val >= 0) {
        wifi_duty_cycle = (val != 0);
        save_duty_cycle();
    }

    httpd_resp_sendstr(req, "OK");
    return ESP_OK;
}

/* Catch-all: return 204 for everything not matched by registered handlers.
 * This satisfies ALL captive portal probes (Android, iOS, Windows) so
 * the phone accepts the connection without showing a portal popup.
 * User types any URL → DNS resolves to us → root handler serves the page. */
static esp_err_t catchall_handler(httpd_req_t *req)
{
    httpd_resp_set_status(req, "204 No Content");
    httpd_resp_send(req, NULL, 0);
    return ESP_OK;
}

/* Map browser JSON command string to SPI command enum + config update */
static void ws_process_command(const char *json)
{
    ESP_LOGI(TAG, "WS cmd: %s", json);

    /* Action commands → enqueue as SPI commands */
    if (strstr(json, "rec_toggle"))     { cmd_enqueue(SPI_CMD_REC_TOGGLE, NULL, 0); return; }
    if (strstr(json, "sd_mount"))       { cmd_enqueue(SPI_CMD_SD_MOUNT, NULL, 0); return; }
    if (strstr(json, "sd_eject"))       { cmd_enqueue(SPI_CMD_SD_EJECT, NULL, 0); return; }
    if (strstr(json, "sd_format"))      { cmd_enqueue(SPI_CMD_SD_FORMAT, NULL, 0); return; }
    if (strstr(json, "survey_start"))   { cmd_enqueue(SPI_CMD_SURVEY_START, NULL, 0); return; }
    if (strstr(json, "survey_clear"))   { cmd_enqueue(SPI_CMD_SURVEY_CLEAR, NULL, 0); return; }
    if (strstr(json, "schedule_on"))    { cmd_enqueue(SPI_CMD_SCHEDULE_ON, NULL, 0); return; }
    if (strstr(json, "schedule_off"))   { cmd_enqueue(SPI_CMD_SCHEDULE_OFF, NULL, 0); return; }
    if (strstr(json, "dev_mode"))       { cmd_enqueue(SPI_CMD_DEV_MODE, NULL, 0); return; }
    if (strstr(json, "model_reload"))   { cmd_enqueue(SPI_CMD_MODEL_RELOAD, NULL, 0); return; }

    /* Config changes → update local_cfg + bump seq so STM32 adopts */
    if (strstr(json, "set_config")) {
        char *p;
        if ((p = strstr(json, "\"stId\":\"")) != NULL) {
            p += 8;
            const char *end = strchr(p, '"');
            if (end) {
                int len = end - p;
                if (len > 15) len = 15;
                memcpy(local_cfg.stationId, p, len);
                local_cfg.stationId[len] = '\0';
            }
        }
        if ((p = strstr(json, "\"gain\":")) != NULL)
            local_cfg.gain = (uint8_t)atoi(p + 7);
        if ((p = strstr(json, "\"fmt\":")) != NULL)
            local_cfg.recFormat = (uint8_t)atoi(p + 6);
        if ((p = strstr(json, "\"hpf\":")) != NULL)
            local_cfg.bpfLow = (uint16_t)atoi(p + 6);
        if ((p = strstr(json, "\"lpf\":")) != NULL)
            local_cfg.bpfHigh = (uint16_t)atoi(p + 6);
        if ((p = strstr(json, "\"chunk\":")) != NULL)
            local_cfg.chunkMinutes = (uint8_t)atoi(p + 8);
        if ((p = strstr(json, "\"trigEn\":")) != NULL)
            local_cfg.trigEnabled = (uint8_t)atoi(p + 9);
        if ((p = strstr(json, "\"trigDb\":")) != NULL)
            local_cfg.trigDb = (int8_t)atoi(p + 9);
        if ((p = strstr(json, "\"trigPre\":")) != NULL)
            local_cfg.trigPre = (uint8_t)atoi(p + 10);
        if ((p = strstr(json, "\"trigPost\":")) != NULL)
            local_cfg.trigPost = (uint8_t)atoi(p + 11);
        if ((p = strstr(json, "\"lowBat\":")) != NULL)
            local_cfg.lowBatPct = (uint8_t)atoi(p + 9);
        if ((p = strstr(json, "\"autoStop\":")) != NULL)
            local_cfg.autoStop = (uint8_t)atoi(p + 11);
        if ((p = strstr(json, "\"micHdg\":")) != NULL)
            local_cfg.micHeading = (uint16_t)atoi(p + 9);

        local_cfg_seq++;
        local_cfg.cfg_seq = local_cfg_seq;
        ESP_LOGI(TAG, "Config updated (seq=%lu)", (unsigned long)local_cfg_seq);
        return;
    }

    if (strstr(json, "set_detect")) {
        char *p;
        if ((p = strstr(json, "\"mission\":")) != NULL)
            local_cfg.missionMode = (uint8_t)atoi(p + 10);
        if ((p = strstr(json, "\"conf\":")) != NULL)
            local_cfg.detConfThresh = (uint8_t)atoi(p + 7);
        if ((p = strstr(json, "\"winStep\":")) != NULL)
            local_cfg.detWindowStep = (uint8_t)atoi(p + 10);

        local_cfg_seq++;
        local_cfg.cfg_seq = local_cfg_seq;
        cmd_enqueue(SPI_CMD_SET_DETECT, NULL, 0);
        return;
    }

    if (strstr(json, "set_schedule")) {
        char *p;
        if ((p = strstr(json, "\"sunEn\":")) != NULL)
            local_cfg.sunriseEnabled = (uint8_t)atoi(p + 8);
        if ((p = strstr(json, "\"sunB\":")) != NULL)
            local_cfg.sunriseBefore = (uint16_t)atoi(p + 7);
        if ((p = strstr(json, "\"sunA\":")) != NULL)
            local_cfg.sunriseAfter = (uint16_t)atoi(p + 7);
        if ((p = strstr(json, "\"setEn\":")) != NULL)
            local_cfg.sunsetEnabled = (uint8_t)atoi(p + 8);
        if ((p = strstr(json, "\"setB\":")) != NULL)
            local_cfg.sunsetBefore = (uint16_t)atoi(p + 7);
        if ((p = strstr(json, "\"setA\":")) != NULL)
            local_cfg.sunsetAfter = (uint16_t)atoi(p + 7);
        if ((p = strstr(json, "\"nWin\":")) != NULL)
            local_cfg.numWindows = (uint8_t)atoi(p + 7);
        if ((p = strstr(json, "\"wins\":[")) != NULL) {
            p += 8;
            for (int i = 0; i < local_cfg.numWindows * 2 && i < 16; i++) {
                local_cfg.windows[i] = (uint16_t)atoi(p);
                char *next = strchr(p, ',');
                if (next) p = next + 1; else break;
            }
        }

        local_cfg_seq++;
        local_cfg.cfg_seq = local_cfg_seq;
        return;
    }
}

static esp_err_t ws_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        /* WebSocket handshake — track this client */
        int fd = httpd_req_to_sockfd(req);
        ws_add_client(fd);
        ESP_LOGI(TAG, "WS handshake: fd=%d", fd);
        return ESP_OK;
    }

